[
  {
    "year": "2022",
    "title": "First",
    "description": [
      "The objective was to design a simple, clean portfolio using HTML and CSS to effectively showcase my projects. I initially envisioned a scrolling parallax effect featuring a stream of 1's and 0's in the background, reminiscent of the Matrix. However, due to my limited experience at the time, achieving this effect proved challenging. As a result, I opted for a horizontal looping background within a vertical parallax effect, which still captured the dynamic feel I was aiming for."
    ],
    "image": "/images/portfolio2022.png",
    "link": "https://example.com/project2"
  },
  {
    "year": "2023",
    "title": "Machine",
    "description": [
      "This project marked my first venture after mastering the basics of React, and it quickly proved to be a formidable challenge. Initially, the idea sparked while I was experimenting with animating multiple images in the viewport. My vision was to create a site entirely out of images that would evoke the illusion of a 3D object, rich in perspective and depth.",
      "While HTML attributes made it relatively simple to establish the sense of depth I was aiming for, bringing these \"3D\" elements to life through animation was a daunting task. Thankfully, Framer Motion integrated seamlessly, simplifying the process of creating smooth, dynamic animations, even during React dismounts.",
      "The final product met my expectations, though not without its trade-offs. As anticipated, the heavy reliance on large images did impact site performance, making it sluggish and rendering updates or modifications more cumbersome. Despite these challenges, I succeeded in my objective to craft an unconventional site with a distinctive look and feel—reminiscent of an old, rusted machine."
    ],
    "image": "/images/portfolio2023.png",
    "link": "https://example.com/project2"
  },
  {
    "year": "2024",
    "title": "Contrast",
    "description": [
      "In contrast to my previous portfolio, which felt busy and noisy, my goal with this iteration was to embrace minimalism while still incorporating some flair. I opted for a two-toned, high-contrast color palette accented by splashes of color and subtle movement. My intention was to highlight my skill set without overwhelming visitors with too many distractions. However, the result, while smooth and clean, initially struck me as a bit too subdued.",
      "To bring more life to the design, I introduced subtle animations and interactive elements. These enhancements were carefully selected to elevate the user experience without detracting from the minimalist aesthetic. For example, animated icons and hover effects were implemented to add a touch of dynamism, subtly drawing attention to key sections of the portfolio.",
      "I also devoted considerable thought to the divider sections between different parts of the portfolio. Custom components were developed to create adjustable spacing and visual separation, employing vertical lines and empty space. These dividers not only provided structure and flow but also ensured that each section had its own distinct presence while remaining harmoniously integrated into the overall design."
    ],
    "image": "/images/weatherornought.webp",
    "link": "https://example.com/project2"
  },
  {
    "year": "WIP",
    "title": "SOON",
    "description": [
      "I hope to recreate my portfolio annually, using each iteration as an opportunity to experiment with new technologies, refine my design skills, and showcase my growth as a developer. Stay tuned for more updates!"
    ],
    "image": "/images/soon.webp",
    "link": "https://example.com/project2"
  }
]
